SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[ТипСообщения](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ТипСообщения] [nvarchar](50) NULL,
 CONSTRAINT [aaaaaТипСообщения_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[ТипСообщения] ON
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (1, N'Визирование')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (2, N'Задание')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (3, N'Ознакомление')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (4, N'Подписание')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (5, N'Извещение')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (7, N'Резолюция')
INSERT [dbo].[ТипСообщения] ([Код], [ТипСообщения]) VALUES (13, N'Отчет')
SET IDENTITY_INSERT [dbo].[ТипСообщения] OFF
/****** Object:  Table [dbo].[ТипПроекта]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[ТипПроекта](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ТипПроекта] [nvarchar](50) NULL,
 CONSTRAINT [aaaaaТипПроекта_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[ТипПроекта] ON
INSERT [dbo].[ТипПроекта] ([Код], [ТипПроекта]) VALUES (1, N'Входящий')
INSERT [dbo].[ТипПроекта] ([Код], [ТипПроекта]) VALUES (2, N'Исходящий')
INSERT [dbo].[ТипПроекта] ([Код], [ТипПроекта]) VALUES (3, N'Внутренний')
INSERT [dbo].[ТипПроекта] ([Код], [ТипПроекта]) VALUES (4, N'Прочие')
SET IDENTITY_INSERT [dbo].[ТипПроекта] OFF
/****** Object:  Table [dbo].[Сотрудник]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Сотрудник](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ФИО] [nvarchar](50) NULL,
	[Пароль] [nvarchar](15) NULL,
	[КодДолжности] [int] NULL,
	[КодОтдела] [int] NULL,
	[Работает] [bit] NULL,
	[Логин] [nvarchar](20) NULL,
 CONSTRAINT [aaaaaСотрудник_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Сотрудник] ON
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (1, N'Новиков Сергей  Егорович', N'11111111', 18, 7, 1, N'Novikov')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (2, N'Румянцев Борис  Тимофеевич', N'11111111', 11, 5, 1, N'Rumyancev')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (3, N'Недоплясов Георгий  Степанович', N'11111111', 20, 12, 1, N'Nedoplyasov')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (4, N'Мишечкин Алексей  Михайлович', N'11111111', 6, 7, 1, N'Mishechkin')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (5, N'Мещеринов Богдан  Васильевич', N'11111111', 16, 2, 1, N'Mescherinov')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (6, N'Нежданова Надежда  Власиевна', N'11111111', 10, 4, 1, N'Nejdanova')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (7, N'Михалкин Касьян  Вадимович', N'11111111', 8, 7, 1, N'Mihalkin')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (8, N'Мишуткин Григорий  Павлович', N'11111111', 14, 3, 1, N'Mishutkin')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (10, N'Ожгибесов Георгий  Никитич', N'11111111', 7, 7, 1, N'Ojgibesov')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (11, N'Поварова Ирина  Богдановна', N'11111111', 3, 1, 1, N'Povarova')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (12, N'Таныгин Емельян  Олегович', N'11111111', 2, 1, 1, N'Tanygin')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (13, N'Надежина Прасковья  Витальевна', N'11111111', 19, 8, 1, N'Nadejina')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (14, N'Каганцева Анна  Константиновна', N'11111111', 11, 5, 1, N'Kaganceva')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (15, N'Михалева Вероника  Романовна', N'11111111', 19, 14, 1, N'Mihaleva')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (16, N'Карпичев Роман  Касьянович', N'11111111', 17, 2, 1, N'Karpichev')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (17, N'Гурьянова Клавдия  Константиновна', N'11111111', 19, 13, 1, N'Guryanova')
INSERT [dbo].[Сотрудник] ([Код], [ФИО], [Пароль], [КодДолжности], [КодОтдела], [Работает], [Логин]) VALUES (19, N'Михалкова Елизавета  Георгиевна', N'11111111', 1, 15, 1, N'Mihalkova')
SET IDENTITY_INSERT [dbo].[Сотрудник] OFF
/****** Object:  Table [dbo].[Сообщение]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Сообщение](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ВремяСоздания] [datetime] NULL,
	[ТекстСообщения] [nvarchar](255) NULL,
	[КодПроекта] [int] NULL,
	[ПолучательКодСотрудника] [int] NULL,
	[ОтправительКодСотрудника] [int] NULL,
	[ТипСообщенияКод] [int] NULL,
	[Обработан] [bit] NULL,
	[ТекстОтчета] [nvarchar](255) NULL,
	[ВремяОзнакомления] [datetime] NULL,
	[Отказ] [bit] NULL,
	[Архив] [bit] NULL,
	[Отчет] [bit] NULL,
 CONSTRAINT [aaaaaСообщение_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Сообщение] ON
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (76, CAST(0x0000ABBA0002A220 AS DateTime), N'прошу подписать', 2, 1, 7, 2, 1, NULL, NULL, 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (77, CAST(0x0000ABBA00070508 AS DateTime), N'прошу завизировать', 2, 1, 7, 1, 1, N'Завизировано', CAST(0x0000ABBA0007521E AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (78, CAST(0x0000ABBA0007BC6A AS DateTime), N'выполнить', 24, 7, 1, 2, 1, N'dsgjkybk', CAST(0x0000ABBA0007E13D AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (85, CAST(0x0000ABBA01092D31 AS DateTime), N'прошу завизировать', 24, 7, 1, 1, 1, N'Отказано в визировании', CAST(0x0000ABBA010A5405 AS DateTime), 1, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (95, CAST(0x0000ABBE018A6391 AS DateTime), N'Прошу завизировать', 24, 14, 1, 1, 1, N'Завизировано', CAST(0x0000ABC000000000 AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (96, CAST(0x0000ABC000BD8640 AS DateTime), N'Прошу подписать ', 34, 1, 2, 4, 1, N'Подписано', CAST(0x0000ABC000000000 AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (97, CAST(0x0000ABC000DA0DBC AS DateTime), N'Прошу подписать', 36, 1, 2, 4, 1, N'Подписано', CAST(0x0000ABC000000000 AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (98, CAST(0x0000ABC000DA8B55 AS DateTime), N'Прошу завизировать', 36, 1, 2, 1, 1, N'Завизировано', CAST(0x0000ABC000000000 AS DateTime), 0, 1, 0)
INSERT [dbo].[Сообщение] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (99, CAST(0x0000ABC900030C78 AS DateTime), N'Прошу подписать', 35, 2, 1, 4, 0, NULL, NULL, 0, 0, 0)
SET IDENTITY_INSERT [dbo].[Сообщение] OFF
/****** Object:  Table [dbo].[Проект]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Проект](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[РегДата] [datetime] NULL,
	[ВидДокумента] [int] NULL,
	[КраткоеСодержание] [nvarchar](255) NULL,
	[ПодготовленКодСотрудника] [int] NULL,
	[ПодписанКодСотрудника] [int] NULL,
	[ТипПроекта] [int] NULL,
	[Подписан] [bit] NULL,
	[Закрыт] [bit] NULL,
 CONSTRAINT [aaaaaПроект_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Проект] ON
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (1, CAST(0x0000ABB9017CAF78 AS DateTime), 1, N'Предложение фирмы "Пересвет"', 6, 15, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (2, CAST(0x0000ABB90188B5FC AS DateTime), 4, N'Новая инструкция водителям', 7, 5, 2, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (4, CAST(0x0000ABBA0107A624 AS DateTime), 1, N'О закупке станков', 3, 16, 1, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (5, CAST(0x0000ABBA01084458 AS DateTime), 62, N'Предложение пилы Гасс', 3, 1, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (9, CAST(0x0000ABBA00018E70 AS DateTime), 1, N'О списании инвентаря', 3, 2, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (11, CAST(0x0000ABBA01841664 AS DateTime), 1, N'Закупка компьютеров', 7, 3, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (14, CAST(0x0000ABBA011A7B3C AS DateTime), 79, N'Организовать субботник', 17, 3, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (16, CAST(0x0000ABBA00D0A3B8 AS DateTime), 1, N'Об отпуске', 10, 3, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (17, CAST(0x0000ABBA00FDC08C AS DateTime), 12, N'О закупке инвентаря', 5, 2, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (20, CAST(0x0000ABBA000137B8 AS DateTime), 4, N'К 15 рассмотрите данный проект', 17, 3, 1, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (22, CAST(0x0000ABBA00B34048 AS DateTime), 13, N'О состоянии техники', 3, 12, 1, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (24, CAST(0x0000ABBE018A1334 AS DateTime), 3, N'О закупке станка СПР 23.456', 1, 3, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (27, CAST(0x0000ABC000CD8480 AS DateTime), 1, N'О предоставлении отпуска', 4, 5, 3, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (34, CAST(0x0000ABC000BC5CA1 AS DateTime), 1, N'Об оплате коммунальных услуг', 2, 1, NULL, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (35, CAST(0x0000ABC000D258D2 AS DateTime), 32, N'О закупке трансформатора', 1, 1, NULL, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (36, CAST(0x0000ABC000D9FAE5 AS DateTime), 1, N'тест проекта', 2, 1, NULL, 0, 0)
INSERT [dbo].[Проект] ([Код], [РегДата], [ВидДокумента], [КраткоеСодержание], [ПодготовленКодСотрудника], [ПодписанКодСотрудника], [ТипПроекта], [Подписан], [Закрыт]) VALUES (37, CAST(0x0000ABD1017E01F6 AS DateTime), 1, N'О проведении тестирования измерительных приборов', 1, 13, NULL, 0, NULL)
SET IDENTITY_INSERT [dbo].[Проект] OFF
/****** Object:  Table [dbo].[Отчет]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Отчет](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ВремяСоздания] [datetime] NULL,
	[ТекстСообщения] [nvarchar](255) NULL,
	[КодПроекта] [int] NULL,
	[ПолучательКодСотрудника] [int] NULL,
	[ОтправительКодСотрудника] [int] NULL,
	[ТипСообщенияКод] [int] NULL,
	[Обработан] [bit] NULL,
	[ТекстОтчета] [nvarchar](255) NULL,
	[ВремяОзнакомления] [datetime] NULL,
	[Отказ] [bit] NULL,
	[Архив] [bit] NULL,
	[Отчет] [bit] NULL,
 CONSTRAINT [aaaaaОтчет_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Отчет] ON
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (85, CAST(0x0000ABC000000000 AS DateTime), N'Пользователь Андреев Иван Андреевич положительно обработал ваше сообщение Подписание по проекту №36
Вид документа: Докладная записка

Ваше сообщение: 
тест', 36, 2, 1, NULL, 1, N'Подписано', CAST(0x0000ABC000000000 AS DateTime), 0, 0, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (86, CAST(0x0000ABC000000000 AS DateTime), N'Пользователь Андреев Иван Андреевич положительно обработал ваше сообщение Визирование по проекту №36
Вид документа: Докладная записка

Ваше сообщение: 
тест 2', 36, 2, 1, NULL, 1, N'Завизировано', CAST(0x0000ABC000000000 AS DateTime), 0, 0, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (76, CAST(0x0000ABBA00E409DE AS DateTime), N'Пользователь Андреев Иван Андреевич положительно обработал ваше сообщение Визирование по проекту №2
Вид документа: Должностная инструкция

Ваше сообщение: 
rtrtrtrtr', 2, 7, 1, 0, 1, N'Сделайте все как надо', CAST(0x0000ABBA00E409CF AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (87, CAST(0x0000ABC000000000 AS DateTime), N'Пользователь Уважина Антонина Ивановна положительно обработал ваше сообщение Визирование по проекту №24
Вид документа: Документы по закупке (с оформлением конкурентного листа)

Ваше сообщение: 
Прошу завизировать', 24, 1, 14, NULL, 1, N'Завизировано', CAST(0x0000ABC000000000 AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (79, CAST(0x0000ABBA018079CA AS DateTime), N'Пользователь Андреев Иван Андреевич положительно обработал ваше сообщение Визирование по проекту №4
Вид документа: Докладная записка

Ваше сообщение: 
гол7гло7', 4, 3, 1, NULL, 1, N'голгл', CAST(0x0000ABBA018079C8 AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (80, CAST(0x0000ABBA0181071C AS DateTime), N'Пользователь Ивахин Антон Сергеевич положительно обработал ваше сообщение Визирование по проекту №24
Вид документа: Докладная записка

Ваше сообщение: 
22222gbgbg', 24, 1, 2, NULL, 1, N'Завизировано', CAST(0x0000ABBA0181071A AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (81, CAST(0x0000ABBA01816A2B AS DateTime), N'Пользователь Ивахин Антон Сергеевич положительно обработал ваше сообщение Подписание по проекту №2
Вид документа: Должностная инструкция

Ваше сообщение: 
ghyhghg', 2, 7, 2, NULL, 1, N'Подписано', CAST(0x0000ABBA01816A29 AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (82, CAST(0x0000ABBE0175742C AS DateTime), N'Пользователь Ивахин Антон Сергеевич положительно обработал ваше сообщение Визирование по проекту №24
Вид документа: Докладная записка

Ваше сообщение: 
fgfgfgfgf', 24, 1, 2, NULL, 1, N'Завизировано', CAST(0x0000ABBE01757429 AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (83, CAST(0x0000ABBE0176E135 AS DateTime), N'Пользователь Ивахин Антон Сергеевич положительно обработал ваше сообщение Визирование по проекту №24
Вид документа: Докладная записка

Ваше сообщение: 
gfbdfbd', 24, 1, 2, NULL, 1, N'Завизировано', CAST(0x0000ABBE0176E133 AS DateTime), 0, 1, 0)
INSERT [dbo].[Отчет] ([Код], [ВремяСоздания], [ТекстСообщения], [КодПроекта], [ПолучательКодСотрудника], [ОтправительКодСотрудника], [ТипСообщенияКод], [Обработан], [ТекстОтчета], [ВремяОзнакомления], [Отказ], [Архив], [Отчет]) VALUES (84, CAST(0x0000ABBE01793D8D AS DateTime), N'Пользователь Ивахин Антон Сергеевич положительно обработал ваше сообщение Визирование по проекту №24
Вид документа: Докладная записка

Ваше сообщение: 
xcsdcvsdvc', 24, 1, 2, NULL, 1, N'Завизировано', CAST(0x0000ABBE01793D8C AS DateTime), 0, 1, 0)
SET IDENTITY_INSERT [dbo].[Отчет] OFF
/****** Object:  Table [dbo].[Отдел]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Отдел](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[НаименованиеОтдела] [nvarchar](250) NULL,
 CONSTRAINT [aaaaaОтдел_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Отдел] ON
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (1, N'Финансовый отдел')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (2, N'Торговый отдел')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (3, N'Отдел маркетинга')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (4, N'Отдел логистики')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (5, N'Транспортный отдел')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (7, N'Технический отдел')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (8, N'Отдел перевозок')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (9, N'Отдел производства оборудования специального назначения')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (12, N'Отдел диагностики, тестрования и поверки приборов')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (13, N'Склад готовой продукции')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (14, N'Отдел ремонта машин и оборудования')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (15, N'Управление')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (16, N'Отдел производства электронной аппаратуры')
INSERT [dbo].[Отдел] ([Код], [НаименованиеОтдела]) VALUES (21, N'Отдел кадров')
SET IDENTITY_INSERT [dbo].[Отдел] OFF
/****** Object:  Table [dbo].[Должность]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Должность](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[Должность] [nvarchar](50) NULL,
 CONSTRAINT [aaaaaДолжность_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[Должность] ON
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (1, N'Директор')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (2, N'Главный бухгалтер')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (3, N'Менеджер по финансам')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (4, N'Начальник отдела кадров')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (5, N'Водитель')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (6, N'Менеджер по техническому обслуживанию')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (7, N'Техник по обслуживанию оборудования')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (8, N'Начальник технического отдела')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (9, N'Менеджер по доставке')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (10, N'Специалист по складу')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (11, N'Начальник гаража')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (12, N'Водитель-экспедитор')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (13, N'Ведущий маркетолог')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (14, N'Инженер-технолог')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (15, N'Менеджер по продажам')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (16, N'Инженер-теплотехник')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (17, N'Инженер-энергетик')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (18, N'admin')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (19, N'Настройщик аппаратуры')
INSERT [dbo].[Должность] ([Код], [Должность]) VALUES (20, N'Техник с функциями водителя, кладовщика')
SET IDENTITY_INSERT [dbo].[Должность] OFF
/****** Object:  Table [dbo].[ВидДокумента]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[ВидДокумента](
	[Код] [int] IDENTITY(1,1) NOT NULL,
	[ВидДокумента] [nvarchar](100) NULL,
 CONSTRAINT [aaaaaВидДокумента_PK] PRIMARY KEY NONCLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[ВидДокумента] ON
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (1, N'Докладная записка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (3, N'Документы по закупке (с оформлением конкурентного листа)')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (4, N'Должностная инструкция')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (6, N'Дополнительное соглашение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (7, N'Электронное сообщение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (8, N'Жалоба - Книга замечаний и предложений')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (10, N'Жалоба - письменное обращение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (12, N'Задание на закупку')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (13, N'Заключение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (14, N'Замечание')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (15, N'Запрос')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (16, N'Заявка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (18, N'Заявка на открытие (переоформление) счета')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (19, N'Заявление')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (20, N'Заявление - Книга замечаний и предложений')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (21, N'Заявление - письменное обращение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (23, N'Заявление - устное обращение-личный прием')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (25, N'Извещение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (28, N'Исполнительный лист')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (29, N'Карта отправки')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (30, N'Карточка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (32, N'Коммерческое предложение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (33, N'Конкурентное предложение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (34, N'Конкурсные документы')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (37, N'Материалы Бюджетного комитета')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (41, N'Материалы Комитета по рискам')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (43, N'Материалы комитета по управлению активами и пассивами')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (45, N'Материалы Правления')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (47, N'Международный стандарт')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (48, N'Мероприятия')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (50, N'Образец подписи ответственного исполнителя')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (51, N'Объяснительная')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (54, N'Отзыв на апелляционную жалобу')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (56, N'Отчет')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (60, N'Первичный учетный и иной документ')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (61, N'Перечень')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (62, N'Письмо')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (63, N'План')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (65, N'Повестка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (66, N'Положение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (67, N'Поручение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (68, N'Предложение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (70, N'Предложение - личный прием')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (71, N'Предложение - письменное обращение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (72, N'Предложение - электронное обращение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (74, N'Представление')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (75, N'Прейскурант')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (76, N'Претензия')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (77, N'Приглашение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (79, N'Приказ')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (80, N'Проект Указа')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (81, N'Протест')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (82, N'Протокол')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (83, N'Протокол выемки')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (84, N'Протокол заседания Финансового комитета банка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (85, N'Протокол комиссии')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (87, N'Протокол Наблюдательного совета банка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (88, N'Протокол Общего собрания акционеров банка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (89, N'Протокол поручений')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (90, N'Протокол совещания')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (91, N'Рабочая инструкция')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (92, N'Рабочая программа')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (93, N'Разнарядка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (94, N'Разрешение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (95, N'Распоряжение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (96, N'Регламент')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (97, N'Реестр')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (99, N'Реестр (заказная почта)')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (100, N'Рейтинг')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (101, N'Рекомендации')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (102, N'Решение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (103, N'Руководящие указания')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (104, N'Сводка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (105, N'Соглашение')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (110, N'Специальная доверенность')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (111, N'Спецификация')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (113, N'Справка')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (114, N'Справка о суммах бухгалтерских документов по дебету балансовых счетов')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (115, N'Справка о суммах бухгалтерских документов по операциям')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (116, N'Справка о суммах первичных учетных документов по операциям')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (117, N'Справочник')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (118, N'Статистический бюллетень')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (120, N'Судебный приказ')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (121, N'Счет')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (122, N'Табель')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (123, N'Тарифы')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (124, N'Телеграмма')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (125, N'Телефонограмма')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (126, N'Технические характеристики')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (127, N'Технический регламент')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (128, N'Требование')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (129, N'Уведомление')
INSERT [dbo].[ВидДокумента] ([Код], [ВидДокумента]) VALUES (130, N'Указ Президента России')
SET IDENTITY_INSERT [dbo].[ВидДокумента] OFF
/****** Object:  Table [dbo].[Files]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Files](
	[IdFiles] [int] IDENTITY(1,1) NOT NULL,
	[IdProecta] [int] NULL,
	[NameFiles] [nvarchar](255) NULL,
	[ShortNameFiles] [nvarchar](50) NULL,
 CONSTRAINT [aaaaaFiles_PK] PRIMARY KEY NONCLUSTERED 
(
	[IdFiles] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
/****** Object:  Table [dbo].[FileBase]    Script Date: 06/21/2020 15:04:09 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[FileBase](
	[IdFileBase] [int] IDENTITY(1,1) NOT NULL,
	[PathFileBase] [nvarchar](255) NULL,
	[IspOtnositPut] [bit] NULL,
	[OtnositPathFileBase] [nvarchar](255) NULL,
 CONSTRAINT [aaaaaFileBase_PK] PRIMARY KEY NONCLUSTERED 
(
	[IdFileBase] ASC
)WITH (PAD_INDEX  = OFF, STATISTICS_NORECOMPUTE  = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS  = ON, ALLOW_PAGE_LOCKS  = ON) ON [PRIMARY]
) ON [PRIMARY]
GO
SET IDENTITY_INSERT [dbo].[FileBase] ON
INSERT [dbo].[FileBase] ([IdFileBase], [PathFileBase], [IspOtnositPut], [OtnositPathFileBase]) VALUES (1, N'D:\BaseDoc\', 0, N'D:\BaseDoc\')
SET IDENTITY_INSERT [dbo].[FileBase] OFF
